; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v11 ?v2)
             (pred_7 ?v5 ?v6)
             (pred_4 ?v11 ?v6)
             (pred_10 ?v8 ?v11 )
	     (pred_9 ?v11)
             (pred_11 ?v9)
             (pred_3 ?v5)
             (pred_12 ?v6)
             (pred_5 ?v11)
             (pred_2 ?v5)
             (pred_8 ?v11)
             (pred_1 ))



(:action op_2
:parameters (?v12 ?v13 ?v4 ?v3)
:precondition (and (pred_11 ?v12) (pred_11 ?v13) (pred_3 ?v4) (pred_12 ?v3)
          (pred_6 ?v12 ?v13) (pred_7 ?v4 ?v3)
                   (pred_4 ?v13 ?v3) (pred_9 ?v12) 
                   (pred_5 ?v13) (pred_2 ?v4))
:effect (and  (pred_8 ?v13) (not (pred_5 ?v13))))


(:action op_1
:parameters (?v12 ?v10)
:precondition (and (pred_11 ?v12) (pred_11 ?v10)
               (pred_9 ?v12) (pred_6 ?v12 ?v10) (pred_8 ?v10))
:effect (and (pred_9 ?v10) (not (pred_9 ?v12))))

(:action op_3
:parameters (?v12 ?v4)
:precondition (and (pred_11 ?v12) (pred_3 ?v4) 
                  (pred_9 ?v12) (pred_10 ?v4 ?v12) (pred_1 ))
:effect (and (pred_2 ?v4)
   (not (pred_10 ?v4 ?v12)) (not (pred_1 ))))


(:action op_5
:parameters (?v12 ?v1 ?v7)
:precondition (and (pred_11 ?v12) (pred_3 ?v1) (pred_3 ?v7)
                  (pred_9 ?v12) (pred_2 ?v7) (pred_10 ?v1 ?v12))
:effect (and (pred_2 ?v1) (pred_10 ?v7 ?v12)
        (not (pred_2 ?v7)) (not (pred_10 ?v1 ?v12))))

(:action op_4
:parameters (?v12 ?v4)
:precondition (and (pred_11 ?v12) (pred_3 ?v4) 
                  (pred_9 ?v12) (pred_2 ?v4))
:effect (and (pred_1 ) (pred_10 ?v4 ?v12) (not (pred_2 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_25 obj_04 obj_06 obj_29 obj_22 obj_24 obj_01 obj_18 obj_03 obj_31 obj_11 obj_21 obj_02 obj_30 obj_05 obj_10 obj_20 obj_26 obj_28 obj_13 obj_14 obj_19 obj_08 obj_16 obj_12
    obj_09 obj_27 obj_15
    obj_17 obj_23 obj_32 obj_07
    )

    (:init
       (pred_1)

       (pred_11 obj_25)
       (pred_11 obj_04)
       (pred_11 obj_06)
       (pred_11 obj_29)
       (pred_11 obj_22)
       (pred_11 obj_24)
       (pred_11 obj_01)
       (pred_11 obj_18)
       (pred_11 obj_03)
       (pred_11 obj_31)
       (pred_11 obj_11)
       (pred_11 obj_21)
       (pred_11 obj_02)
       (pred_11 obj_30)
       (pred_11 obj_05)
       (pred_11 obj_10)
       (pred_11 obj_20)
       (pred_11 obj_26)
       (pred_11 obj_28)
       (pred_11 obj_13)
       (pred_11 obj_14)
       (pred_11 obj_19)
       (pred_11 obj_08)
       (pred_11 obj_16)
       (pred_11 obj_12)
       (pred_12 obj_09)
       (pred_12 obj_27)
       (pred_12 obj_15)
       (pred_3 obj_17)
       (pred_3 obj_23)
       (pred_3 obj_32)
       (pred_3 obj_07)

       (pred_6 obj_25 obj_24)
       (pred_6 obj_25 obj_04)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_04 obj_25)
       (pred_6 obj_06 obj_18)
       (pred_6 obj_06 obj_29)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_29 obj_03)
       (pred_6 obj_29 obj_22)
       (pred_6 obj_29 obj_06)
       (pred_6 obj_22 obj_31)
       (pred_6 obj_22 obj_29)
       (pred_6 obj_24 obj_11)
       (pred_6 obj_24 obj_01)
       (pred_6 obj_24 obj_25)
       (pred_6 obj_01 obj_21)
       (pred_6 obj_01 obj_18)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_01 obj_24)
       (pred_6 obj_18 obj_02)
       (pred_6 obj_18 obj_03)
       (pred_6 obj_18 obj_06)
       (pred_6 obj_18 obj_01)
       (pred_6 obj_03 obj_30)
       (pred_6 obj_03 obj_31)
       (pred_6 obj_03 obj_29)
       (pred_6 obj_03 obj_18)
       (pred_6 obj_31 obj_05)
       (pred_6 obj_31 obj_22)
       (pred_6 obj_31 obj_03)
       (pred_6 obj_11 obj_10)
       (pred_6 obj_11 obj_21)
       (pred_6 obj_11 obj_24)
       (pred_6 obj_21 obj_20)
       (pred_6 obj_21 obj_02)
       (pred_6 obj_21 obj_01)
       (pred_6 obj_21 obj_11)
       (pred_6 obj_02 obj_26)
       (pred_6 obj_02 obj_30)
       (pred_6 obj_02 obj_18)
       (pred_6 obj_02 obj_21)
       (pred_6 obj_30 obj_28)
       (pred_6 obj_30 obj_05)
       (pred_6 obj_30 obj_03)
       (pred_6 obj_30 obj_02)
       (pred_6 obj_05 obj_13)
       (pred_6 obj_05 obj_31)
       (pred_6 obj_05 obj_30)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_10 obj_20)
       (pred_6 obj_10 obj_11)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_20 obj_26)
       (pred_6 obj_20 obj_21)
       (pred_6 obj_20 obj_10)
       (pred_6 obj_26 obj_08)
       (pred_6 obj_26 obj_28)
       (pred_6 obj_26 obj_02)
       (pred_6 obj_26 obj_20)
       (pred_6 obj_28 obj_16)
       (pred_6 obj_28 obj_13)
       (pred_6 obj_28 obj_30)
       (pred_6 obj_28 obj_26)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_13 obj_05)
       (pred_6 obj_13 obj_28)
       (pred_6 obj_14 obj_19)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_19 obj_20)
       (pred_6 obj_19 obj_14)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_08 obj_26)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_16 obj_12)
       (pred_6 obj_16 obj_28)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_12 obj_16)
       (pred_5 obj_04)
       (pred_5 obj_05)
       (pred_5 obj_20)
       (pred_5 obj_28)
       (pred_4  obj_04 obj_09)
       (pred_4  obj_05 obj_27)
       (pred_4  obj_20 obj_15)
       (pred_4  obj_28 obj_27)
       (pred_8 obj_25)
       (pred_8 obj_06)
       (pred_8 obj_29)
       (pred_8 obj_22)
       (pred_8 obj_24)
       (pred_8 obj_01)
       (pred_8 obj_18)
       (pred_8 obj_03)
       (pred_8 obj_31)
       (pred_8 obj_11)
       (pred_8 obj_21)
       (pred_8 obj_02)
       (pred_8 obj_30)
       (pred_8 obj_10)
       (pred_8 obj_26)
       (pred_8 obj_13)
       (pred_8 obj_14)
       (pred_8 obj_19)
       (pred_8 obj_08)
       (pred_8 obj_16)
       (pred_8 obj_12)

       (pred_7  obj_17 obj_09)
       (pred_7  obj_23 obj_27)
       (pred_7  obj_32 obj_15)
       (pred_7  obj_07 obj_09)
       (pred_10 obj_17 obj_22)
       (pred_10 obj_23 obj_25)
       (pred_10 obj_32 obj_16)
       (pred_10 obj_07 obj_18)
       (pred_9 obj_16)
    )

    (:goal (and
       (pred_10 obj_17 obj_02)
    ))
(:constraints
  (always (not (pred_9 obj_29)))
)
)

; plan
1. (op_3 obj_16 obj_32)
   deleted: (pred_10 obj_32 obj_16) (pred_1)
   added: (pred_2 obj_32)
   goals met: 0 of 1
2. (op_1 obj_16 obj_08)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_08)
   goals met: 0 of 1
3. (op_1 obj_08 obj_26)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_26)
   goals met: 0 of 1
4. (op_1 obj_26 obj_02)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_02)
   goals met: 0 of 1
5. (op_4 obj_02 obj_32)
   deleted: (pred_2 obj_32)
   added: (pred_1) (pred_10 obj_32 obj_02)
   goals met: 0 of 1
6. (op_1 obj_02 obj_18)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_18)
   goals met: 0 of 1
7. (op_1 obj_18 obj_03)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_03)
   goals met: 0 of 1
8. (op_1 obj_03 obj_31)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_31)
   goals met: 0 of 1
9. (op_1 obj_31 obj_22)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_22)
   goals met: 0 of 1
10. (op_3 obj_22 obj_17)
   deleted: (pred_10 obj_17 obj_22) (pred_1)
   added: (pred_2 obj_17)
   goals met: 0 of 1
11. (op_1 obj_22 obj_31)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_31)
   goals met: 0 of 1
12. (op_1 obj_31 obj_03)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_03)
   goals met: 0 of 1
13. (op_1 obj_03 obj_18)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_18)
   goals met: 0 of 1
14. (op_1 obj_18 obj_02)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_02)
   goals met: 0 of 1
15. (op_5 obj_02 obj_32 obj_17)
   deleted: (pred_2 obj_17) (pred_10 obj_32 obj_02)
   added: (pred_2 obj_32) (pred_10 obj_17 obj_02)
   goals met: 1 of 1
